Revit 2027 API
LinePatternElement.Create Method
 Creates a new LinePatternElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LinePatternElement Create(
	Document document,
	LinePattern linePattern
)
Public Shared Function Create (
	document As Document,
	linePattern As LinePattern
) As LinePatternElement
public:
static LinePatternElement^ Create(
	Document^ document,
	LinePattern^ linePattern
)
static member Create :
        document : Document *
        linePattern : LinePattern -> LinePatternElement
Parameters
document Document
 The document in which to create the LinePatternElement.
linePattern LinePattern
 The LinePattern associated to the newly created LinePatternElement.
Return Value
LinePatternElement
 The newly created LinePatternElement.
Exceptions
Exception | Condition
ArgumentException |  The Line Pattern is not valid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LinePatternElement Class
Autodesk.Revit.DB Namespace